Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_21 (LSTM)               (None, 60, 48)            33600     
_________________________________________________________________
lstm_22 (LSTM)               (None, 60, 128)           90624     
_________________________________________________________________
lstm_23 (LSTM)               (None, 64)                49408     
_________________________________________________________________
dense_21 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_22 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_23 (Dense)             (None, 20)                660       
=================================================================
Total params: 180,532
Trainable params: 180,532
Non-trainable params: 0
_________________________________________________________________

độ chính xác 90.42%
epochs 123