Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_12 (LSTM)               (None, 60, 64)            48896     
_________________________________________________________________
lstm_13 (LSTM)               (None, 60, 64)            33024     
_________________________________________________________________
lstm_14 (LSTM)               (None, 60, 64)            33024     
_________________________________________________________________
lstm_15 (LSTM)               (None, 64)                33024     
_________________________________________________________________
dense_15 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_16 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_17 (Dense)             (None, 20)                660       
=================================================================
Total params: 154,868
Trainable params: 154,868
Non-trainable params: 0
_________________________________________________________________

Độ chính xác 95%
Epochs 75
