Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 60, 32)            20352     
_________________________________________________________________
lstm_1 (LSTM)                (None, 60, 128)           82432     
_________________________________________________________________
lstm_2 (LSTM)                (None, 64)                49408     
_________________________________________________________________
dense (Dense)                (None, 64)                4160      
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 50)                1650      
=================================================================
Total params: 160,082
Trainable params: 160,082
Non-trainable params: 0
_________________________________________________________________

95.34%