Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 60, 64)            48896     
_________________________________________________________________
lstm_1 (LSTM)                (None, 60, 32)            12416     
_________________________________________________________________
lstm_2 (LSTM)                (None, 64)                24832     
_________________________________________________________________
dense (Dense)                (None, 64)                4160      
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 20)                660       
=================================================================
Total params: 93,044
Trainable params: 93,044
Non-trainable params: 0
_________________________________________________________________

độ chính xác 3.34%
epochs 189