Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_11 (LSTM)               (None, 60, 64)            48896     
_________________________________________________________________
lstm_12 (LSTM)               (None, 60, 32)            12416     
_________________________________________________________________
lstm_13 (LSTM)               (None, 64)                24832     
_________________________________________________________________
dense_12 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_13 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_14 (Dense)             (None, 50)                1650      
=================================================================
Total params: 94,034
Trainable params: 94,034
Non-trainable params: 0
_________________________________________________________________

86.83%