Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_12 (LSTM)               (None, 60, 32)            20352     
_________________________________________________________________
lstm_13 (LSTM)               (None, 60, 128)           82432     
_________________________________________________________________
lstm_14 (LSTM)               (None, 64)                49408     
_________________________________________________________________
dense_12 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_13 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_14 (Dense)             (None, 20)                660       
=================================================================
Total params: 159,092
Trainable params: 159,092
Non-trainable params: 0
_________________________________________________________________

độ chính xác 93.75%
epochs 93