Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_6 (LSTM)                (None, 60, 64)            48896     
_________________________________________________________________
lstm_7 (LSTM)                (None, 128)               98816     
_________________________________________________________________
dense_9 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_10 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_11 (Dense)             (None, 20)                660       
=================================================================
Total params: 158,708
Trainable params: 158,708
Non-trainable params: 0
_________________________________________________________________

Độ chính xác: 96.67%
Epochs: 100
