Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_27 (LSTM)               (None, 60, 64)            48896     
_________________________________________________________________
lstm_28 (LSTM)               (None, 60, 128)           98816     
_________________________________________________________________
lstm_29 (LSTM)               (None, 32)                20608     
_________________________________________________________________
dense_27 (Dense)             (None, 64)                2112      
_________________________________________________________________
dense_28 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_29 (Dense)             (None, 20)                660       
=================================================================
Total params: 173,172
Trainable params: 173,172
Non-trainable params: 0
_________________________________________________________________

epochs 150
độ chính xác 3.33%