Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_24 (LSTM)               (None, 60, 44)            30096     
_________________________________________________________________
lstm_25 (LSTM)               (None, 60, 128)           88576     
_________________________________________________________________
lstm_26 (LSTM)               (None, 64)                49408     
_________________________________________________________________
dense_24 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_25 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_26 (Dense)             (None, 20)                660       
=================================================================
Total params: 174,980
Trainable params: 174,980
Non-trainable params: 0
_________________________________________________________________

độ chính xác 3.33%
epochs 104
