_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_6 (LSTM)                (None, 60, 64)            48896     
_________________________________________________________________
lstm_7 (LSTM)                (None, 60, 128)           98816     
_________________________________________________________________
lstm_8 (LSTM)                (None, 64)                49408     
_________________________________________________________________
dense_6 (Dense)              (None, 64)                4160      
_________________________________________________________________
dense_7 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_8 (Dense)              (None, 50)                1650      
=================================================================
Total params: 205,010
Trainable params: 205,010
Non-trainable params: 0
_________________________________________________________________

Accuracy: 89.83 %