Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_9 (LSTM)                (None, 60, 64)            48896     
_________________________________________________________________
lstm_10 (LSTM)               (None, 60, 48)            21696     
_________________________________________________________________
lstm_11 (LSTM)               (None, 64)                28928     
_________________________________________________________________
dense_9 (Dense)              (None, 64)                4160      
_________________________________________________________________
dense_10 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_11 (Dense)             (None, 20)                660       
=================================================================
Total params: 106,420
Trainable params: 106,420
Non-trainable params: 0
_________________________________________________________________

Độ chính xác 92.917%
epochs 109